cfe llm/DataProcessors/AI_Песочница.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>AI_Песочница</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ОчередьЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ОчередьЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AI_Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вложение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_СтатусОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНовойОперации</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_ТипAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ТипAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Responses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ChatCompletions</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_ДополнительныйКонтекст.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_ДополнительныйКонтекст</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеКонтекста</Name>					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляЛогики</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/DataProcessors/AI_Песочница/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СистемныйПромтПриИзменении(Элемент)
	СистемныйПромтПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Укажите файл вложение";
	ДиалогВыбораФайла.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВебПоискПриИзменении(Элемент)
	ОчиститьСообщения();
	ИспользоватьВебПоискПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
		СоставФайла = СтрРазделить(ПутьКФайлу, ПолучитьРазделительПутиКлиента(), Ложь);
		ИмяФайла = СоставФайла[СоставФайла.Количество()-1];
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
		ОтправитьНаСервере(ИмяФайла, ДвоичныеДанные);
	Иначе
		ОтправитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВОчередьОбработки(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Агент) Тогда
		Сообщить("Для постановки в очередь выберите агента.");
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеЧтенияИнформации", ЭтаФорма);

	ПоказатьВопрос(Оповещение, "Запрос будет выполнен в фоне по настройкам агента, а не этой формы. "
		+ "Ответ здесь не покажется: его получит обработчик конфигурации, которого агент находит "
		+ "по программному идентификатору. Поставить запрос в очередь?",
		РежимДиалогаВопрос.ДаНет, , , "Очередь запросов");

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРЗОбработки(Команда)
	Если СтатусРегламентногоЗадания = "" ИЛИ СтатусРегламентногоЗадания = "Стоп" Тогда
		ПодключитьОбработчикОжидания("ПроверкаСтатусаРЗ", 5, Ложь);
		Элементы.ФормаЗапуститьРЗОбработки.Заголовок = "Очередь: запуск...";
	КонецЕсли;
	ЗапуститьРЗОбработкиНаСервере();
КонецПроцедуры

// СброситьДиалог
// Сбрасывает контекст диалога для обоих типов API.
&НаКлиенте
Процедура СброситьДиалог(Команда)
	СброситьДиалогНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере(ИмяФайла=Неопределено, ДвоичныеДанные=Неопределено)

	ДанныеВебПоиска = Новый Структура;
	ДанныеВебПоиска.Вставить("ИспользоватьВебПоиск", ИспользоватьВебПоиск);
	ДанныеВебПоиска.Вставить("РазмерОкнаКонтекстаВебПоиска", РазмерОкнаКонтекстаВебПоиска);
	ДанныеВебПоиска.Вставить("URL", URI.Выгрузить().ВыгрузитьКолонку("URL"));
	
	// ── Создаём и настраиваем объект AI_Клиент ──────────────────────────
	ОбъектКлиент = Обработки.AI_Клиент.Создать();
 	ОбъектКлиент.Инициализировать(Провайдер, Модель, ТипAPI, РежимДиалога, ГлубинаДиалога);
	ОбъектКлиент.ИнициализироватьСистемныйПромтПроизвольный(
			ПроизвольныйПромт,
			Температура,
			МаксТокенов,
			ДанныеВебПоиска,
			ДанныеДляИспользованияRAG(),
			ПолучитьДополнительныйКонтекст(),
			Агент);
	
	// ── Для Responses API: восстанавливаем ID предыдущего ответа ─────────
	// Это ключевой момент для работы диалога в Responses API.
	// Объект AI_Клиент создаётся заново при каждом серверном вызове,
	// поэтому _ПредыдущийIDОтвета нужно передать снаружи.
	Если ЗначениеЗаполнено(ИдентификаторДиалогаResponseApi) Тогда
		ОбъектКлиент.УстановитьПредыдущийIDОтвета(ИдентификаторДиалогаResponseApi);
	КонецЕсли;
	
	// ── Для ChatCompletions: передаём ID диалога из AI_Диалоги ──────────
	Если РежимДиалога И ЗначениеЗаполнено(ИдентификаторДиалога)
		И НЕ ИдентификаторДиалога = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
		ОбъектКлиент.ИдентификаторДиалога = ИдентификаторДиалога;
	КонецЕсли;
	
	// ── Выполняем запрос ─────────────────────────────────────────────────
	Попытка
		Если ЗначениеЗаполнено(ИмяФайла) И ЗначениеЗаполнено(ДвоичныеДанные) Тогда
			ОбъектКлиент.СпроситьСКартинкой(Промт, ИмяФайла, ДвоичныеДанные);
		Иначе
			ОбъектКлиент.Спросить(Промт);
		КонецЕсли;
	Исключение
		ОбработатьОшибкуЗапроса(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	// ── Обработка результата ─────────────────────────────────────────────
	Если ЗначениеЗаполнено(ОбъектКлиент.ОшибкаОбработки) Тогда
		Сообщить("Ошибка обработки: " + ОбъектКлиент.ОшибкаОбработки);
	КонецЕсли;
	
	// Показываем ответ
	Попытка
		Если ИзвлечьОтвет Тогда
			ТекстОтвета = ОбъектКлиент.ИзвлеченныйОтвет;
			Если ТекстОтвета = Неопределено Тогда
				ТекстОтвета = ОбъектКлиент.ПреобразоватьОтветВСтроку().Ответ;
			КонецЕсли;
		Иначе
			ОбъектКлиент.ПреобразоватьОтветВСтроку();
			ТекстОтвета = ОбъектКлиент.Ответ;
		КонецЕсли;
	Исключение
		Если ТипЗнч(ОбъектКлиент.Ответ) = Тип("Строка") Тогда
			НачалоОтвета = ОбъектКлиент.Ответ;
		Иначе
			НачалоОтвета = "";
		КонецЕсли;
		ТекстОтвета = НачалоОтвета + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Ответ.УстановитьТекст(ТекстОтвета);
	
	// ── Сохраняем ID диалога для следующего шага ─────────────────────────
	//
	// Responses API: сохраняем строковый ID ответа сервера.
	// Этот ID будет передан в следующий запрос как previous_response_id.
	// ОбъектКлиент.ИдентификаторДиалога для Responses API содержит этот строковый ID
	// (установлен в СпроситьResponses через _ПредыдущийIDОтвета).
	Если ТипAPI = Перечисления.AI_ТипAPI.Responses Тогда
		НовыйID = ОбъектКлиент.ИдентификаторДиалога;
		Если ЗначениеЗаполнено(НовыйID) Тогда
			ИдентификаторДиалогаResponseApi = НовыйID;
		КонецЕсли;
	Иначе
		// ChatCompletions: ID диалога — UUID из AI_Диалоги
		Если РежимДиалога И ЗначениеЗаполнено(ОбъектКлиент.ИдентификаторДиалога) Тогда
			ИдентификаторДиалога = ОбъектКлиент.ИдентификаторДиалога;
		КонецЕсли;
	КонецЕсли;
	
	// Статистика токенов
	ВходящиеТокены = ОбъектКлиент.ВходящиеТокены;
	ВыходящиеТокены = ОбъектКлиент.ВыходящиеТокены;
	ТокеныНавыков = ОбъектКлиент.ТулТокены;
	ВсегоТокенов = ВходящиеТокены + ВыходящиеТокены;
	
КонецПроцедуры

&НаСервере
Процедура СброситьДиалогНаСервере()
	
	// Responses API — сбрасываем строковый ID цепочки
	ИдентификаторДиалогаResponseApi = "";
	
	// ChatCompletions — сбрасываем UUID диалога из AI_Диалоги
	ИдентификаторДиалога = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Ответ.УстановитьТекст("");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаСтатусаРЗ() Экспорт
	
	Выполняется = ПроверкаСтатусаНаСервере();
	
	Если Не Выполняется Тогда
		Элементы.ФормаЗапуститьРЗОбработки.Заголовок = "Обработать очередь сейчас";
		ОтключитьОбработчикОжидания("ПроверкаСтатусаРЗ");
		ИдентификаторФоновогоЗадания = Неопределено;
		ПоказатьОповещениеПользователя("Очередь запросов обработана");
	Иначе
		Элементы.ФормаЗапуститьРЗОбработки.Заголовок = "Очередь обрабатывается...";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьРЗОбработкиНаСервере()
	
	Если Не ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		ИдентификаторФоновогоЗадания = ФоновыеЗадания.Выполнить("AI_ОбработкаСервер.ОбработкаОчереди", Новый Массив, "Обработка_очереди", "Обработка очереди").УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаСтатусаНаСервере()
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания);
	Возврат Задание.Состояние = СостояниеФоновогоЗадания.Активно;
КонецФункции

&НаКлиенте
Процедура ПослеЧтенияИнформации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = Неопределено;
	
	Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
		СоставФайла = СтрРазделить(ПутьКФайлу, ПолучитьРазделительПутиКлиента(), Ложь);
		ИмяФайла = СоставФайла[СоставФайла.Количество()-1];
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	КонецЕсли;
	
	ПослеЧтенияИнформацииНаСервере(ДвоичныеДанные);
	
	Сообщить("Запрос поставлен в очередь. Обработка с помощью РЗ AI_ОбработкаОчередиЗапросов");
	
КонецПроцедуры

&НаСервере
Процедура ПослеЧтенияИнформацииНаСервере(ДвоичныеДанные)
	
	РегистрыСведений.AI_ОчередьЗапросов.ПоставитьЗапросВОчередь(Провайдер, ТипAPI, Модель, Агент, Промт, ПутьКФайлу, ДвоичныеДанные);
	
КонецПроцедуры

&НаСервере
Процедура СистемныйПромтПриИзмененииНаСервере()
	
	ДополнительныйКонтекст.Очистить();
	RAGКоллекции.Очистить();
	RAGРазрешения.Очистить();
	URI.Очистить();

	Если Не ЗначениеЗаполнено(Агент) Тогда
		Возврат;
	КонецЕсли;
	
	ПроизвольныйПромт = Агент.СистемнаяИнструкция;
	Температура = Агент.Температура;
	МаксТокенов = Агент.МаксТокенов;
	ИзвлечьОтвет = Агент.ИзвлекатьОтветВСтруктуру;
	ИспользоватьВебПоиск = Агент.НуженВебПоиск;
	РазмерОкнаКонтекстаВебПоиска = Агент.ОкноКонтекстаВебПоиска;

	Для Каждого ДопКонтекст Из Агент.ДополнительныйКонтекст Цикл
		НоваяСтрока = ДополнительныйКонтекст.Добавить();
		НоваяСтрока.Контекст = ДопКонтекст.Контекст;
	КонецЦикла;

	Для Каждого СтрокаRAG Из Агент.RAGКоллекции Цикл
		НоваяСтрока = RAGКоллекции.Добавить();
		НоваяСтрока.Использовать = СтрокаRAG.Использовать;
		НоваяСтрока.Коллекция = СтрокаRAG.Коллекция;
		НоваяСтрока.ЛимитФрагментовQdrant = СтрокаRAG.ЛимитФрагментовQdrant;
		НоваяСтрока.ВесКоллекции = СтрокаRAG.ВесКоллекции;
		НоваяСтрока.МинПорогСхожестиВектора = СтрокаRAG.МинПорогСхожестиВектора;
	КонецЦикла;
	
	Для Каждого СтрокаРазрешения Из Агент.RAGРазрешения Цикл
		НоваяСтрока = RAGРазрешения.Добавить();
		НоваяСтрока.Разрешение = СтрокаРазрешения.Разрешение.Наименование;
		НоваяСтрока.ТипРазрешения = СтрокаРазрешения.Разрешение.ТипРазрешения;
	КонецЦикла;

	Для Каждого Адрес Из Агент.URLДляПоиска Цикл
		НоваяСтрока = URI.Добавить();
		НоваяСтрока.URL = Адрес.URL;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработатьОшибкуЗапроса(ТекстОшибки)

	НормализованныйТекст = НРег(ТекстОшибки);
	Если СтрНайти(НормализованныйТекст, "превышен таймаут") > 0 Тогда
		ТекстДляПользователя =
			"Превышен таймаут запроса к модели. Увеличьте «Таймаут запроса к модели, сек» "
			+ "в карточке провайдера или упростите запрос.";
	ИначеЕсли СтрНайти(НормализованныйТекст, "ошибка получения вектора") > 0 Тогда
		ТекстДляПользователя =
			"Не удалось получить контекст RAG. Проверьте embedding-сервис и выбранные RAG-коллекции.";
	Иначе
		ТекстДляПользователя = "Не удалось выполнить запрос к модели. Подробности записаны в журнал регистрации.";
	КонецЕсли;

	Ответ.УстановитьТекст(ТекстДляПользователя);
	ЗаписьЖурналаРегистрации(
		"AI_Песочница.Запрос",
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстОшибки);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = Результат[0];
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДополнительныйКонтекст()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"Выбрать ДанныеКонтекста, Наименование, ИдентификаторДляЛогики Из Справочник.AI_ДополнительныйКонтекст ГДЕ Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ДополнительныйКонтекст.Выгрузить().ВыгрузитьКолонку("Контекст"));
	
	ДанныеДопКонтекста = Запрос.Выполнить().Выбрать();
	
	ДопКонтекст = Новый Массив;
	Пока ДанныеДопКонтекста.Следующий() Цикл
		СтруктураКонтекста = Новый Структура("ДанныеКонтекста, Наименование, ИдентификаторДляЛогики");
		СтруктураКонтекста.ДанныеКонтекста = ДанныеДопКонтекста.ДанныеКонтекста.Получить();
		СтруктураКонтекста.Наименование = ДанныеДопКонтекста.Наименование;
		СтруктураКонтекста.ИдентификаторДляЛогики = ДанныеДопКонтекста.ИдентификаторДляЛогики;
		
		ДопКонтекст.Добавить(СтруктураКонтекста);
	КонецЦикла;
		
	Возврат ДопКонтекст;
	
КонецФункции

// Отмеченные строки коллекций формы в том же виде, что AI_Клиент собирает для агента.
Функция ДанныеДляИспользованияRAG()

	Возврат AI_RAG.ДанныеRAGПоНастройкам(RAGКоллекции.Выгрузить());

КонецФункции

// ПроверитьДоступностьВебПоиска
// Веб-поиск доступен только при типе API = Responses.
// При других типах — сбрасываем флаг и информируем пользователя.
&НаСервере
Процедура ПроверитьДоступностьВебПоиска()
	
	Если НЕ ИспользоватьВебПоиск Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипAPI = Перечисления.AI_ТипAPI.Responses ИЛИ НЕ Справочники.AI_Провайдеры.ТипПоддерживается(Провайдер, ТипAPI) Тогда
		Сообщить("Встроенный веб-поиск доступен только для провайдеров с типом API ""Responses"". Флаг сброшен.");
		ИспользоватьВебПоиск = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПровайдерПриИзмененииНаСервере()
	
	// При смене провайдера — сбрасываем веб-поиск если новый провайдер не поддерживает
	ПроверитьДоступностьВебПоиска();
	
	// Сбрасываем диалог при смене провайдера
	ИдентификаторДиалогаResponseApi = "";
	ИдентификаторДиалога = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецПроцедуры

&НаКлиенте
Процедура ПровайдерПриИзменении(Элемент)
	ПровайдерПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспользоватьВебПоискПриИзмененииНаСервере()
	ПроверитьДоступностьВебПоиска();
КонецПроцедуры

#КонецОбласти
